<template>
  <div class="container">
    <h1>קורסים</h1>
     <div class="curses">
        <CurseForPage v-for="(curse, index) in curses" :description="curse.description" :name="curse.name" :img="curse.img" :key.sync="index">
        </CurseForPage>
      </div>
      <Footer></Footer>
  </div>
</template>

<script>
  import Footer from "@/components/Footer.vue";
  import CurseForPage from "@/components/CurseForPage.vue";

  export default {
  name: "Curses",
  components: {
      CurseForPage,
      Footer
    },
    data(){
      return{
        curses: [
          {
            img: "curses - CrossFit",
            name: "CrossFit",
            description: "אימון קרוספיט נותן מענה בספקטרום רחב של מאפייני כושר גופני: סיבולת לב-ריאה, סיבולת שריר, כוח גמישות, עוצמה, מהירות, קורדינציה, זריזות, שיווי-משקל ודיוק. את התוכנית שלנו אנחנו מכינים בקפידה על ידי צוות מדריכים מנוסים שבוחנים ובודקים את האימונים לפני הביצוע שלהם למתאמנים בפועל"
          },
          {
            img: "curses - Yoga",
            name: "יוגה",
            description: "השיעורים משלבים את זרמי האשטאנגה וויניאסה יוגה, ומפתחים גמישות ורכות מול עוצמה וכוח. השיעורים דינמיים ואקטיביים ובהם שמים דגש על הנשימה ותנועה אשר יוצרת גמישות, ויטאליות וחוזק"
          },
           {
            img: "curses - Burn",
            name: "Burn",
            description: "אימון פונקציונלי בעל תכונות מורכבות המדמה פעילות יומיומית. האימון מתאפיין באינטנסיביות גבוהה, תרגילי כוח ותנועה, משלב עבודה על כמה קבוצות שרירים יחד ויוצר שיפור בכל מרכיבי הכושר הגופני. מטרת האימון לשמור על דופק גבוה לאורך זמן - תוך דגש על תנועה נכונה"
          },
          {
            img: "curses - MatPilates",
            name: "פילאטיס מזרן",
            description: "משלב את עולם הקונטרלוג'י - שיטתו המקורית של ג'וזף פילאטיס. בתוך השקפה כי הגוף ראוי להתייחסות, הנעת רקמות, יצירת תנועה וזרימה. שיעור יגע במנחים שונים, נשימה נכונה ומדיטציה"
          },
          {
            img: "curses - machinePilates",
            name: "פילאטיס מכשירים",
            description: "פילאטיס בשילוב מכשירים שונים כגון מיטות אימון. העבודה על המכשירים מחזקת את השרירים ומאתגרת ביותר"
          },
          {
            img: "curses - Zumba",
            name: "זומבה",
            description: "שיעורי זומבה הם למעשה אירובי דאנס המשלב מוזיקה מדרום אמריקה יחד עם צעדי ריקוד לטיניים ובינלאומיים, כמו סלסה, רומבה, צ'ה צ'ה, סמבה, טנגו וכו. צעדי הריקוד נלמדים משיעור לשיעור. הריקודים נלמדים בכל שיעורים וחוזרים בשיעורים הבאים – כל אחת יכולה ללמוד את הצעדים"
          },
           {
            img: "curses - BodyShape",
            name: "עיצוב הגוף",
            description: "שיעור עיצוב לחיזוק השרירים בעזרת אביזרים: כדור, גומיות, בר וחזרה על תרגילים המשפרים יציבה , מסייעים בחיזוק הגוף, ונותנים דגש על כוח"
          },
          {
            img: "curses - trampoline",
            name: "טרמפולינה",
            description: "בשיעור זה כל מתאמן עובד על טרמפולינה אישית. רוב השיעור מתבצע על הטרמפולינה תוך ביצוע תרגילים אינטנסיביים ומהירים. מטרת השיעור היא עבודה על סבולת לב ריאה וחיזוק השרירים. השיעור מומלץ מאוד ואף מסייע בחיטוב הגוף"
          },
           {
            img: "curses - BodyPower",
            name: "בודי פאוור",
            description: "שיעור חדשני המשלב בין עולם חדר הכושר לסטודיו. בשיעור נעשה שימוש במשקולות ומוטות באופן דומה לעבודה בחדר הכושר. מטרת השיעור היא חיזוק הגוף ועבודה איטית ונכונה על כל קבוצות השרירים העיקריות בגוף"
          },
          {
            img: "curses - kikbox",
            name: "קיקבוקס",
            description: "הקיקבוקס הוא שיעור אירובי בסטודיו הלקוח מתוך שיטת הלחימה טקוואנדו, מטרת השיעור היא שריפת קלוריות מרבית וחיזוק והגמשת הגוף. השיעור מתבסס על תנועות האגרוף תוך שילוב של עבודת אירובי"
          }
        ]
      }
    },
    created() {

            window.scrollTo(0,0);
    }
  }
</script>

<style scoped>

  .curses{
    margin: 2rem auto;
  }

  h1{
    font-size: 3rem;
    margin-top: 3rem;
  }

  @media(min-width: 52rem)
  {
    .curses{
      display: flex;
      flex-wrap: wrap;
    }
  }

</style>